# coding:utf-8
# 模拟简单的订票流程
dict_1={
    'G1001':['北京南-天津南','18:01','18:34','00:33'],
    'G1002':['北京南-天津西','18:04','18:55','00:51'],
    'G1003':['北京南-天津东','18:03','19:34','01:31'],
    'G1004':['北京南-天津北','19:01','19:44','00:43']
}
print('车次\t\t出发站-到达站\t出发时间\t到达时间\t历时时长')
for key in dict_1.keys():
    print(key,end='\t')
    for i in dict_1.get(key):
        print(i,end='\t')
    # 换行
    print()

no_1=input('请输入你要购买的车次:')
info_1=dict_1.get(no_1,'车次不存在!')
if info_1!='车次不存在!':
    person_1=input('请输入乘车人,如果是多位则使用逗号分割:')
    info_2=info_1[0]+' '+info_1[1]+'开'
    print('你已购买了'+no_1+'车次('+info_2+'),请',person_1,'尽快换取纸质车票。【铁路客服】')
else:
    print('当前车次不存在!')

